; domain
; author Oscar Lima : olima_84@yahoo.com
; Youbot BTT domain, used for transportation tasks
; This domain can be used for robocup@work competition
; http://www.robocupatwork.org/
; license : GPLv3

(define (domain yb_general_domain)
 (:requirements :typing :action-costs)
 (:types
  	location      		; service areas, points of interest, navigation goals
  	robot         		; your amazing yet powerful robot
  	object				; objects to be manipulated by the robot
  	gripper				; robot gripper
  	robot_platform		; platform slots for the robot to store objects
 )

 (:predicates

	; robot ?r is at location ?l
 	(at ?r - robot ?l - location)

 	; object ?o is on location ?l
 	(on ?o - object ?l - location)

 	; object ?o is stored on robot platform ?rp
 	(stored ?o - object ?rp - robot_platform)

 	; robot platform ?rp is occupied, yb has 3 free places to store objects
	(occupied ?rp - robot_platform)

	; gripper ?g is holding object ?o
	(holding ?g - gripper ?o - object)

	; gripper ?g is free (does not contain object)
	(gripper_is_free ?g - gripper)

	; an object ?o is perceived when object recognition was triggered
	; gets lost if the robot moves the base
	(perceived ?l - location)
 )

 (:functions
	  (path-length ?source ?destination - location) - number
  	(total-cost) - number
 )

; moves a robot ?r from ?source - location to a ?destination - location
; NOTE : the situation in which the robot arm is in any position before moving
; is not handled at the planning level, hence we advise to always move the arm
; to a folded position, then navigate
 (:action move_base_safe
     :parameters (?source ?destination - location ?r - robot ?g - gripper)
     :precondition (and (at ?r ?source)
     					(gripper_is_free ?g)
     			   )
     :effect (and (not (at ?r ?source))
     			  (at ?r ?destination)
     			  (not (perceived ?destination))
     			  (not (perceived ?source))
            (increase (total-cost) (path-length ?source ?destination))
     		 )
 )

 ; perceive an object ?o which is in a location ?l with a empty gripper ?g
 ; to find the pose of this object before it can be picked
 (:action perceive_location
   :parameters (?l - location ?r - robot ?g - gripper)
   :precondition 	(and 	(at ?r ?l)
   							        ;(on ?o ?l) ; add ?o - object if you uncomment this line
   							        (gripper_is_free ?g)
   							        (not (perceived ?l))
   					      )
   :effect 	(and 	(perceived ?l)
   					;(increase (total-cost) (perception-complexity ?o))
   					(increase (total-cost) 1)
  			)
 )

 ; pick an object ?o which is inside a location ?l with a free gripper ?g
 ; with robot ?r that is at location ?l
 (:action pick
     :parameters (?o - object ?l - location ?r - robot ?g - gripper)
     :precondition 	(and 	(on ?o ?l)
                      		(at ?r ?l)
                      		(perceived ?l)
                      		(gripper_is_free ?g)
                      		(not (holding ?g ?o))
                   	)
     :effect (and  	(holding ?g ?o)
                   	(not (on ?o ?l))
                   	(not (gripper_is_free ?g))
                   	(holding ?g ?o)
                   	(increase (total-cost) 1)
             )
 )

 (:action place
     :parameters (?o - object ?l - location ?r - robot ?g - gripper)
     :precondition  (and  (at ?r ?l)
                          (holding ?g ?o)
                          (not (on ?o ?l))
                          (not (perceived ?l)) ;under testing, not really required
                          (not (gripper_is_free ?g))
                    )
     :effect (and   (on ?o ?l)
                    (not (holding ?g ?o))
                    (gripper_is_free ?g)
                    (increase (total-cost) 1)
             )
 )


 ; stage an object ?o in a robot platform ?rp which is not occupied with a gripper ?g
 ; which is holding the object ?o
 (:action stage
     :parameters (?o - object ?rp - robot_platform ?g - gripper)
     :precondition 	(and 	(holding ?g ?o)
                      		(not (occupied ?rp))
                            (not (gripper_is_free ?g))
                   	)
     :effect (and  	(not (holding ?g ?o))
	 				          (gripper_is_free ?g)
     			   	      (stored ?o ?rp)
                   	(occupied ?rp)
                   	(increase (total-cost) 1)
             )
 )

 ; unstage an object ?o stored on a robot platform ?rp with a free gripper ?g
 (:action unstage
     :parameters (?o - object ?rp - robot_platform ?g - gripper)
     :precondition 	(and 	(gripper_is_free ?g)
                      		(stored ?o ?rp)
                      		(not (holding ?g ?o))
                   	)
     :effect (and  	(not (gripper_is_free ?g))
     			   	      (not (stored ?o ?rp))
                   	(not (occupied ?rp))
                   	(holding ?g ?o)
                   	(increase (total-cost) 1)
             )
 )
)

; problem
(define (problem robocup_symposium_experiments_1)
(:domain yb_general_domain)
(:objects

    ; robots
    youbot-brsu-5 - robot

    ; robot available platforms, to store objects inside the robot
    platform_middle platform_left platform_right - robot_platform

    ; grippers
    dynamixel - gripper
    
    ; locations
    S1 S2 S3 S4 S5 S6 - location
    START - location

    ; objects
    o1 - object
    o2 - object
    o3 - object
    o4 - object
    o5 - object
    o6 - object
    o7 - object
    o8 - object
    o9 - object
    o10 - object
    o11 - object
    o12 - object
    o13 - object
    o14 - object
    o15 - object
    o16 - object
)
(:init
    ; initialize total cost
    (= (total-cost) 0)

    ; distance matrix lower triangle
    (= (path-length START S1) 3)
    (= (path-length START S2) 4)
    (= (path-length START S3) 7)
    (= (path-length START S4) 7)
    (= (path-length START S5) 7)
    (= (path-length START S6) 7)

    (= (path-length S1 S2) 4)
    (= (path-length S1 S3) 7)
    (= (path-length S1 S4) 7)
    (= (path-length S1 S5) 7)
    (= (path-length S1 S6) 7)

    (= (path-length S2 S3) 7)
    (= (path-length S2 S4) 7)
    (= (path-length S2 S5) 6)
    (= (path-length S2 S6) 6)

    (= (path-length S3 S4) 2)
    (= (path-length S3 S5) 3)
    (= (path-length S3 S6) 4)

    (= (path-length S4 S5) 2)
    (= (path-length S4 S6) 3)

    (= (path-length S5 S6) 2)

    ;----------------------------

    ; distance matrix upper repeated triangle information
    (= (path-length S1 START) 3)
    (= (path-length S2 START) 4)
    (= (path-length S3 START) 7)
    (= (path-length S4 START) 7)
    (= (path-length S5 START) 7)
    (= (path-length S6 START) 7)

    (= (path-length S2 S1) 4)
    (= (path-length S3 S1) 7)
    (= (path-length S4 S1) 7)
    (= (path-length S5 S1) 6)
    (= (path-length S6 S1) 7)

    (= (path-length S3 S2) 7)
    (= (path-length S4 S2) 7)
    (= (path-length S5 S2) 6)
    (= (path-length S6 S2) 6)

    (= (path-length S4 S3) 2)
    (= (path-length S5 S3) 3)
    (= (path-length S6 S3) 4)

    (= (path-length S5 S4) 2)
    (= (path-length S6 S4) 3)

    (= (path-length S6 S5) 2)

    ;---------------------------

    ; useless information, but required by some planners for completeness
    (= (path-length START START) 100)
    (= (path-length S1 S1) 100)
    (= (path-length S2 S2) 100)
    (= (path-length S3 S3) 100)
    (= (path-length S4 S4) 100)
    (= (path-length S5 S5) 100)
    (= (path-length S6 S6) 100)

    ; robot initial conditions : location
    (at youbot-brsu-5 START) ; youbot is at start position

    ; status of the gripper at the beginning
    (gripper_is_free dynamixel)

    ; where are the objects located?
    (on o1 S1)
    (on o2 S4)
    (on o3 S2)
    (on o4 S3)
    (on o5 S2)
    (on o6 S1)
    (on o7 S2)
    (on o8 S3)
    (on o9 S6)
    (on o10 S4)
    (on o11 S5)
    (on o12 S2)
    (on o13 S5)
    (on o14 S6)
    (on o15 S4)
    (on o16 S3)
)
(:goal (and
            ; transportation tasks
            (on o1 S5)
		    (on o2 S6)
            (on o3 S5)
            (on o4 S6)
            (on o5 S6)
            (on o6 S5)
            (on o7 S4)
            (on o8 S2)
            (on o9 S3)
            (on o10 S5)
            (on o11 S1)
            (on o12 S3)
            (on o13 S1)
            (on o14 S2)
            (on o15 S6)
            (on o16 S5)
        )
)
(:metric minimize (total-cost))
)

; plan
1. (move_base_safe start s1 youbot-brsu-5 dynamixel)
   deleted: (at youbot-brsu-5 start)
   added: (at youbot-brsu-5 s1)
   goals met: 0 of 16
2. (perceive_location s1 youbot-brsu-5 dynamixel)
   added: (perceived s1)
   goals met: 0 of 16
3. (pick o1 s1 youbot-brsu-5 dynamixel)
   deleted: (on o1 s1) (gripper_is_free dynamixel)
   added: (holding dynamixel o1)
   goals met: 0 of 16
4. (stage o1 platform_left dynamixel)
   deleted: (holding dynamixel o1)
   added: (gripper_is_free dynamixel) (stored o1 platform_left) (occupied platform_left)
   goals met: 0 of 16
5. (pick o6 s1 youbot-brsu-5 dynamixel)
   deleted: (on o6 s1) (gripper_is_free dynamixel)
   added: (holding dynamixel o6)
   goals met: 0 of 16
6. (stage o6 platform_middle dynamixel)
   deleted: (holding dynamixel o6)
   added: (gripper_is_free dynamixel) (stored o6 platform_middle) (occupied platform_middle)
   goals met: 0 of 16
7. (move_base_safe s1 s5 youbot-brsu-5 dynamixel)
   deleted: (at youbot-brsu-5 s1) (perceived s1)
   added: (at youbot-brsu-5 s5)
   goals met: 0 of 16
8. (unstage o1 platform_left dynamixel)
   deleted: (gripper_is_free dynamixel) (stored o1 platform_left) (occupied platform_left)
   added: (holding dynamixel o1)
   goals met: 0 of 16
9. (place o1 s5 youbot-brsu-5 dynamixel)
   deleted: (holding dynamixel o1)
   added: (on o1 s5) (gripper_is_free dynamixel)
   goals met: 1 of 16
10. (unstage o6 platform_middle dynamixel)
   deleted: (gripper_is_free dynamixel) (stored o6 platform_middle) (occupied platform_middle)
   added: (holding dynamixel o6)
   goals met: 1 of 16
11. (place o6 s5 youbot-brsu-5 dynamixel)
   deleted: (holding dynamixel o6)
   added: (on o6 s5) (gripper_is_free dynamixel)
   goals met: 2 of 16
12. (move_base_safe s5 s4 youbot-brsu-5 dynamixel)
   deleted: (at youbot-brsu-5 s5)
   added: (at youbot-brsu-5 s4)
   goals met: 2 of 16
13. (perceive_location s4 youbot-brsu-5 dynamixel)
   added: (perceived s4)
   goals met: 2 of 16
14. (pick o10 s4 youbot-brsu-5 dynamixel)
   deleted: (on o10 s4) (gripper_is_free dynamixel)
   added: (holding dynamixel o10)
   goals met: 2 of 16
15. (stage o10 platform_left dynamixel)
   deleted: (holding dynamixel o10)
   added: (gripper_is_free dynamixel) (stored o10 platform_left) (occupied platform_left)
   goals met: 2 of 16
16. (pick o2 s4 youbot-brsu-5 dynamixel)
   deleted: (on o2 s4) (gripper_is_free dynamixel)
   added: (holding dynamixel o2)
   goals met: 2 of 16
17. (stage o2 platform_middle dynamixel)
   deleted: (holding dynamixel o2)
   added: (gripper_is_free dynamixel) (stored o2 platform_middle) (occupied platform_middle)
   goals met: 2 of 16
18. (pick o15 s4 youbot-brsu-5 dynamixel)
   deleted: (on o15 s4) (gripper_is_free dynamixel)
   added: (holding dynamixel o15)
   goals met: 2 of 16
19. (stage o15 platform_right dynamixel)
   deleted: (holding dynamixel o15)
   added: (gripper_is_free dynamixel) (stored o15 platform_right) (occupied platform_right)
   goals met: 2 of 16
20. (move_base_safe s4 s6 youbot-brsu-5 dynamixel)
   deleted: (at youbot-brsu-5 s4) (perceived s4)
   added: (at youbot-brsu-5 s6)
   goals met: 2 of 16
21. (unstage o15 platform_right dynamixel)
   deleted: (gripper_is_free dynamixel) (stored o15 platform_right) (occupied platform_right)
   added: (holding dynamixel o15)
   goals met: 2 of 16
22. (place o15 s6 youbot-brsu-5 dynamixel)
   deleted: (holding dynamixel o15)
   added: (on o15 s6) (gripper_is_free dynamixel)
   goals met: 3 of 16
23. (unstage o2 platform_middle dynamixel)
   deleted: (gripper_is_free dynamixel) (stored o2 platform_middle) (occupied platform_middle)
   added: (holding dynamixel o2)
   goals met: 3 of 16
24. (place o2 s6 youbot-brsu-5 dynamixel)
   deleted: (holding dynamixel o2)
   added: (on o2 s6) (gripper_is_free dynamixel)
   goals met: 4 of 16
25. (perceive_location s6 youbot-brsu-5 dynamixel)
   added: (perceived s6)
   goals met: 4 of 16
26. (pick o14 s6 youbot-brsu-5 dynamixel)
   deleted: (on o14 s6) (gripper_is_free dynamixel)
   added: (holding dynamixel o14)
   goals met: 4 of 16
27. (stage o14 platform_middle dynamixel)
   deleted: (holding dynamixel o14)
   added: (gripper_is_free dynamixel) (stored o14 platform_middle) (occupied platform_middle)
   goals met: 4 of 16
28. (pick o9 s6 youbot-brsu-5 dynamixel)
   deleted: (on o9 s6) (gripper_is_free dynamixel)
   added: (holding dynamixel o9)
   goals met: 4 of 16
29. (stage o9 platform_right dynamixel)
   deleted: (holding dynamixel o9)
   added: (gripper_is_free dynamixel) (stored o9 platform_right) (occupied platform_right)
   goals met: 4 of 16
30. (move_base_safe s6 s3 youbot-brsu-5 dynamixel)
   deleted: (at youbot-brsu-5 s6) (perceived s6)
   added: (at youbot-brsu-5 s3)
   goals met: 4 of 16
31. (unstage o9 platform_right dynamixel)
   deleted: (gripper_is_free dynamixel) (stored o9 platform_right) (occupied platform_right)
   added: (holding dynamixel o9)
   goals met: 4 of 16
32. (place o9 s3 youbot-brsu-5 dynamixel)
   deleted: (holding dynamixel o9)
   added: (on o9 s3) (gripper_is_free dynamixel)
   goals met: 5 of 16
33. (perceive_location s3 youbot-brsu-5 dynamixel)
   added: (perceived s3)
   goals met: 5 of 16
34. (pick o16 s3 youbot-brsu-5 dynamixel)
   deleted: (on o16 s3) (gripper_is_free dynamixel)
   added: (holding dynamixel o16)
   goals met: 5 of 16
35. (stage o16 platform_right dynamixel)
   deleted: (holding dynamixel o16)
   added: (gripper_is_free dynamixel) (stored o16 platform_right) (occupied platform_right)
   goals met: 5 of 16
36. (move_base_safe s3 s5 youbot-brsu-5 dynamixel)
   deleted: (at youbot-brsu-5 s3) (perceived s3)
   added: (at youbot-brsu-5 s5)
   goals met: 5 of 16
37. (unstage o10 platform_left dynamixel)
   deleted: (gripper_is_free dynamixel) (stored o10 platform_left) (occupied platform_left)
   added: (holding dynamixel o10)
   goals met: 5 of 16
38. (place o10 s5 youbot-brsu-5 dynamixel)
   deleted: (holding dynamixel o10)
   added: (on o10 s5) (gripper_is_free dynamixel)
   goals met: 6 of 16
39. (unstage o16 platform_right dynamixel)
   deleted: (gripper_is_free dynamixel) (stored o16 platform_right) (occupied platform_right)
   added: (holding dynamixel o16)
   goals met: 6 of 16
40. (place o16 s5 youbot-brsu-5 dynamixel)
   deleted: (holding dynamixel o16)
   added: (on o16 s5) (gripper_is_free dynamixel)
   goals met: 7 of 16
41. (perceive_location s5 youbot-brsu-5 dynamixel)
   added: (perceived s5)
   goals met: 7 of 16
42. (pick o11 s5 youbot-brsu-5 dynamixel)
   deleted: (on o11 s5) (gripper_is_free dynamixel)
   added: (holding dynamixel o11)
   goals met: 7 of 16
43. (stage o11 platform_left dynamixel)
   deleted: (holding dynamixel o11)
   added: (gripper_is_free dynamixel) (stored o11 platform_left) (occupied platform_left)
   goals met: 7 of 16
44. (pick o13 s5 youbot-brsu-5 dynamixel)
   deleted: (on o13 s5) (gripper_is_free dynamixel)
   added: (holding dynamixel o13)
   goals met: 7 of 16
45. (stage o13 platform_right dynamixel)
   deleted: (holding dynamixel o13)
   added: (gripper_is_free dynamixel) (stored o13 platform_right) (occupied platform_right)
   goals met: 7 of 16
46. (move_base_safe s5 s1 youbot-brsu-5 dynamixel)
   deleted: (at youbot-brsu-5 s5) (perceived s5)
   added: (at youbot-brsu-5 s1)
   goals met: 7 of 16
47. (unstage o11 platform_left dynamixel)
   deleted: (gripper_is_free dynamixel) (stored o11 platform_left) (occupied platform_left)
   added: (holding dynamixel o11)
   goals met: 7 of 16
48. (place o11 s1 youbot-brsu-5 dynamixel)
   deleted: (holding dynamixel o11)
   added: (on o11 s1) (gripper_is_free dynamixel)
   goals met: 8 of 16
49. (unstage o13 platform_right dynamixel)
   deleted: (gripper_is_free dynamixel) (stored o13 platform_right) (occupied platform_right)
   added: (holding dynamixel o13)
   goals met: 8 of 16
50. (place o13 s1 youbot-brsu-5 dynamixel)
   deleted: (holding dynamixel o13)
   added: (on o13 s1) (gripper_is_free dynamixel)
   goals met: 9 of 16
51. (move_base_safe s1 s2 youbot-brsu-5 dynamixel)
   deleted: (at youbot-brsu-5 s1)
   added: (at youbot-brsu-5 s2)
   goals met: 9 of 16
52. (unstage o14 platform_middle dynamixel)
   deleted: (gripper_is_free dynamixel) (stored o14 platform_middle) (occupied platform_middle)
   added: (holding dynamixel o14)
   goals met: 9 of 16
53. (place o14 s2 youbot-brsu-5 dynamixel)
   deleted: (holding dynamixel o14)
   added: (on o14 s2) (gripper_is_free dynamixel)
   goals met: 10 of 16
54. (perceive_location s2 youbot-brsu-5 dynamixel)
   added: (perceived s2)
   goals met: 10 of 16
55. (pick o12 s2 youbot-brsu-5 dynamixel)
   deleted: (on o12 s2) (gripper_is_free dynamixel)
   added: (holding dynamixel o12)
   goals met: 10 of 16
56. (stage o12 platform_left dynamixel)
   deleted: (holding dynamixel o12)
   added: (gripper_is_free dynamixel) (stored o12 platform_left) (occupied platform_left)
   goals met: 10 of 16
57. (pick o3 s2 youbot-brsu-5 dynamixel)
   deleted: (on o3 s2) (gripper_is_free dynamixel)
   added: (holding dynamixel o3)
   goals met: 10 of 16
58. (stage o3 platform_middle dynamixel)
   deleted: (holding dynamixel o3)
   added: (gripper_is_free dynamixel) (stored o3 platform_middle) (occupied platform_middle)
   goals met: 10 of 16
59. (move_base_safe s2 s5 youbot-brsu-5 dynamixel)
   deleted: (at youbot-brsu-5 s2) (perceived s2)
   added: (at youbot-brsu-5 s5)
   goals met: 10 of 16
60. (unstage o3 platform_middle dynamixel)
   deleted: (gripper_is_free dynamixel) (stored o3 platform_middle) (occupied platform_middle)
   added: (holding dynamixel o3)
   goals met: 10 of 16
61. (place o3 s5 youbot-brsu-5 dynamixel)
   deleted: (holding dynamixel o3)
   added: (on o3 s5) (gripper_is_free dynamixel)
   goals met: 11 of 16
62. (move_base_safe s5 s3 youbot-brsu-5 dynamixel)
   deleted: (at youbot-brsu-5 s5)
   added: (at youbot-brsu-5 s3)
   goals met: 11 of 16
63. (unstage o12 platform_left dynamixel)
   deleted: (gripper_is_free dynamixel) (stored o12 platform_left) (occupied platform_left)
   added: (holding dynamixel o12)
   goals met: 11 of 16
64. (place o12 s3 youbot-brsu-5 dynamixel)
   deleted: (holding dynamixel o12)
   added: (on o12 s3) (gripper_is_free dynamixel)
   goals met: 12 of 16
65. (perceive_location s3 youbot-brsu-5 dynamixel)
   added: (perceived s3)
   goals met: 12 of 16
66. (pick o4 s3 youbot-brsu-5 dynamixel)
   deleted: (on o4 s3) (gripper_is_free dynamixel)
   added: (holding dynamixel o4)
   goals met: 12 of 16
67. (stage o4 platform_left dynamixel)
   deleted: (holding dynamixel o4)
   added: (gripper_is_free dynamixel) (stored o4 platform_left) (occupied platform_left)
   goals met: 12 of 16
68. (pick o8 s3 youbot-brsu-5 dynamixel)
   deleted: (on o8 s3) (gripper_is_free dynamixel)
   added: (holding dynamixel o8)
   goals met: 12 of 16
69. (stage o8 platform_right dynamixel)
   deleted: (holding dynamixel o8)
   added: (gripper_is_free dynamixel) (stored o8 platform_right) (occupied platform_right)
   goals met: 12 of 16
70. (move_base_safe s3 s6 youbot-brsu-5 dynamixel)
   deleted: (at youbot-brsu-5 s3) (perceived s3)
   added: (at youbot-brsu-5 s6)
   goals met: 12 of 16
71. (unstage o4 platform_left dynamixel)
   deleted: (gripper_is_free dynamixel) (stored o4 platform_left) (occupied platform_left)
   added: (holding dynamixel o4)
   goals met: 12 of 16
72. (place o4 s6 youbot-brsu-5 dynamixel)
   deleted: (holding dynamixel o4)
   added: (on o4 s6) (gripper_is_free dynamixel)
   goals met: 13 of 16
73. (move_base_safe s6 s2 youbot-brsu-5 dynamixel)
   deleted: (at youbot-brsu-5 s6)
   added: (at youbot-brsu-5 s2)
   goals met: 13 of 16
74. (unstage o8 platform_right dynamixel)
   deleted: (gripper_is_free dynamixel) (stored o8 platform_right) (occupied platform_right)
   added: (holding dynamixel o8)
   goals met: 13 of 16
75. (place o8 s2 youbot-brsu-5 dynamixel)
   deleted: (holding dynamixel o8)
   added: (on o8 s2) (gripper_is_free dynamixel)
   goals met: 14 of 16
76. (perceive_location s2 youbot-brsu-5 dynamixel)
   added: (perceived s2)
   goals met: 14 of 16
77. (pick o5 s2 youbot-brsu-5 dynamixel)
   deleted: (on o5 s2) (gripper_is_free dynamixel)
   added: (holding dynamixel o5)
   goals met: 14 of 16
78. (stage o5 platform_left dynamixel)
   deleted: (holding dynamixel o5)
   added: (gripper_is_free dynamixel) (stored o5 platform_left) (occupied platform_left)
   goals met: 14 of 16
79. (pick o7 s2 youbot-brsu-5 dynamixel)
   deleted: (on o7 s2) (gripper_is_free dynamixel)
   added: (holding dynamixel o7)
   goals met: 14 of 16
80. (stage o7 platform_right dynamixel)
   deleted: (holding dynamixel o7)
   added: (gripper_is_free dynamixel) (stored o7 platform_right) (occupied platform_right)
   goals met: 14 of 16
81. (move_base_safe s2 s6 youbot-brsu-5 dynamixel)
   deleted: (at youbot-brsu-5 s2) (perceived s2)
   added: (at youbot-brsu-5 s6)
   goals met: 14 of 16
82. (unstage o5 platform_left dynamixel)
   deleted: (gripper_is_free dynamixel) (stored o5 platform_left) (occupied platform_left)
   added: (holding dynamixel o5)
   goals met: 14 of 16
83. (place o5 s6 youbot-brsu-5 dynamixel)
   deleted: (holding dynamixel o5)
   added: (on o5 s6) (gripper_is_free dynamixel)
   goals met: 15 of 16
84. (move_base_safe s6 s4 youbot-brsu-5 dynamixel)
   deleted: (at youbot-brsu-5 s6)
   added: (at youbot-brsu-5 s4)
   goals met: 15 of 16
85. (unstage o7 platform_right dynamixel)
   deleted: (gripper_is_free dynamixel) (stored o7 platform_right) (occupied platform_right)
   added: (holding dynamixel o7)
   goals met: 15 of 16
86. (place o7 s4 youbot-brsu-5 dynamixel)
   deleted: (holding dynamixel o7)
   added: (on o7 s4) (gripper_is_free dynamixel)
   goals met: 16 of 16
